Revit 2027 API
BuiltInFailures.CurtainWallFailures.ExessiveBeltDistance Property
 The requested Measurement Line Offset would place the put the Measurement Line of the face boundaries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExessiveBeltDistance { get; }
Public Shared ReadOnly Property ExessiveBeltDistance As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExessiveBeltDistance {
	FailureDefinitionId^ get ();
}
static member ExessiveBeltDistance : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace